<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>&#1044;&#1080;&#1089;&#1082;&#1088;&#1077;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1077; &#1088;&#1072;&#1079;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1072;&#1074; &#1074; Linux. &#1048;&#1089;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1074;&#1083;&#1080;&#1103;&#1085;&#1080;&#1103; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1074;</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>&#1048;&#1085;&#1076;&#1080;&#1074;&#1080;&#1076;&#1091;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#8211; &#1101;&#1090;&#1072;&#1087; 4<br/></p>
<p>&#1050;&#1091;&#1079;&#1100;&#1084;&#1080;&#1085; &#1040;&#1088;&#1090;&#1077;&#1084;<br/></p>
<p>16 &#1084;&#1072;&#1088;&#1090;&#1072;, 2025, &#1052;&#1086;&#1089;&#1082;&#1074;&#1072;, &#1056;&#1086;&#1089;&#1089;&#1080;&#1103;<br/></p>
<p>&#1056;&#1086;&#1089;&#1089;&#1080;&#1081;&#1089;&#1082;&#1080;&#1081; &#1059;&#1085;&#1080;&#1074;&#1077;&#1088;&#1089;&#1080;&#1090;&#1077;&#1090; &#1044;&#1088;&#1091;&#1078;&#1073;&#1099; &#1053;&#1072;&#1088;&#1086;&#1076;&#1086;&#1074;<br/></p>
<p>1/8</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p><b>&#1062;&#1077;&#1083;&#1080; &#1080; &#1079;&#1072;&#1076;&#1072;&#1095;&#1080;</b></p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p><b>&#1062;&#1077;&#1083;&#1100;<br/></b></p>
<p>&#1062;&#1077;&#1083;&#1100;&#1102; &#1076;&#1072;&#1085;&#1085;&#1086;&#1081; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; <br/>&#1080;&#1079;&#1091;&#1095;&#1077;&#1085;&#1080;&#1077; &#1089;&#1082;&#1072;&#1085;&#1077;&#1088;&#1072; &#1091;&#1103;&#1079;&#1074;&#1080;&#1084;&#1086;&#1089;&#1090;&#1077;&#1081; nikto.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p><b>&#1042;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077; &#1083;&#1072;&#1073;&#1086;&#1088;&#1072;&#1090;&#1086;&#1088;&#1085;&#1086;&#1081;<br/>&#1088;&#1072;&#1073;&#1086;&#1090;&#1099;</b></p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p><b>&#1042;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;<br/></b></p>
<p>Nikto &#8212; &#1101;&#1090;&#1086; &#1087;&#1086;&#1087;&#1091;&#1083;&#1103;&#1088;&#1085;&#1099;&#1081; &#1089;&#1082;&#1072;&#1085;&#1077;&#1088; &#1074;&#1077;&#1073;-<br/>&#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1086;&#1074; &#1089; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1084; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1084; &#1082;&#1086;&#1076;&#1086;&#1084;, <br/>&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1103;&#1077;&#1090; &#1074;&#1077;&#1073;-&#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1099; &#1085;&#1072; <br/>&#1085;&#1072;&#1083;&#1080;&#1095;&#1080;&#1077; &#1091;&#1103;&#1079;&#1074;&#1080;&#1084;&#1086;&#1089;&#1090;&#1077;&#1081;, &#1085;&#1077;&#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1099;&#1093; <br/>&#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1082;, &#1091;&#1089;&#1090;&#1072;&#1088;&#1077;&#1074;&#1096;&#1080;&#1093; &#1074;&#1077;&#1088;&#1089;&#1080;&#1081; &#1055;&#1054; &#1080; <br/>&#1087;&#1088;&#1086;&#1095;&#1080;&#1093; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080;. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p><b>&#1042;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;<br/></b></p>
<p>Nikto &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085; &#1085;&#1072; Perl, &#1080; &#1076;&#1083;&#1103; &#1077;&#1075;&#1086; <br/>&#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1085;&#1072;&#1083;&#1080;&#1095;&#1080;&#1077; Perl &#1085;&#1072; <br/>&#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077;. &#1057;&#1082;&#1072;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1074;&#1077;&#1073;-&#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1072;<br/></p>
<p>perl nikto.pl -h </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p><b>&#1057;&#1082;&#1072;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;<br/></b></p>
<p>Nikto &#1084;&#1086;&#1078;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1076;&#1083;&#1103; &#1087;&#1072;&#1089;&#1089;&#1080;&#1074;&#1085;&#1086;&#1075;&#1086; <br/>&#1089;&#1082;&#1072;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; DVWA, &#1074;&#1099;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1073;&#1072;&#1079;&#1086;&#1074;&#1099;&#1093; <br/>&#1091;&#1103;&#1079;&#1074;&#1080;&#1084;&#1086;&#1089;&#1090;&#1077;&#1081; &#1080; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1086;&#1082; &#1085;&#1072; &#1085;&#1077;&#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1091;&#1102; <br/>&#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1102;. &#1050;&#1086;&#1075;&#1076;&#1072; DVWA &#1079;&#1072;&#1087;&#1091;&#1097;&#1077;&#1085;&#1086;, &#1084;&#1099; <br/>&#1084;&#1086;&#1078;&#1077;&#1084; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; Nikto &#1076;&#1083;&#1103; &#1089;&#1082;&#1072;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;. <br/>&#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1086;&#1081; &#1076;&#1083;&#1103; &#1089;&#1082;&#1072;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1073;&#1091;&#1076;&#1077;&#1090;: <br/>perl nikto.pl -h http://localhost/dvwa/</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p><b>&#1057;&#1082;&#1072;&#1085;&#1080;&#1088;&#1074;&#1086;&#1072;&#1085;&#1080;&#1077; localhost<br/></b></p>
<p><b>&#1056;&#1080;&#1089;. 1: &#1058;&#1077;&#1089;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; localhost</b></p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p><b>&#1057;&#1082;&#1072;&#1085;&#1080;&#1088;&#1074;&#1086;&#1072;&#1085;&#1080;&#1077; localhost/dvwa/<br/></b></p>
<p><b>&#1056;&#1080;&#1089;. 1: &#1058;&#1077;&#1089;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; localhost/dvwa/</b></p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p><b>&#1042;&#1099;&#1074;&#1086;&#1076;&#1099;</b></p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p><b>&#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1099; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1083;&#1072;&#1073;&#1086;&#1088;&#1072;&#1090;&#1086;&#1088;&#1085;&#1086;&#1081; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099;<br/></b></p>
<p>&#1042; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1103; <br/>&#1087;&#1086;&#1074;&#1099;&#1089;&#1080;&#1083; &#1089;&#1074;&#1086;&#1080; &#1085;&#1072;&#1074;&#1099;&#1082;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; <br/>&#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081; &#1089; &#1094;&#1077;&#1083;&#1100;&#1102; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1081; <br/>&#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080;. &#1058;&#1072;&#1082;&#1078;&#1077; &#1087;&#1086;&#1079;&#1085;&#1072;&#1082;&#1086;&#1084;&#1080;&#1083;&#1089;&#1103; &#1089; <br/>&#1085;&#1086;&#1074;&#1099;&#1084; &#1089;&#1086;&#1092;&#1090;&#1086;&#1084; &#1087;&#1086;&#1076; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; Nikto. <br/>&#1052;&#1086;&#1097;&#1085;&#1099;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1079;&#1072;&#1081;&#1076;&#1077;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1085;&#1099; &#1074; <br/>&#1101;&#1090;&#1086;&#1084; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1080;. </p>

</div></div>
</body></html>