<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title></title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p><b> <br/> <br/> <br/></b></p>
<p><b>&#1054;&#1090;&#1095;&#1105;&#1090; &#1087;&#1086; &#1083;&#1072;&#1073;&#1086;&#1088;&#1072;&#1090;&#1086;&#1088;&#1085;&#1086;&#1081; &#1088;&#1072;&#1073;&#1086;&#1090;&#1077; &#8470;8</b>  <br/>&#1064;&#1080;&#1092;&#1088; &#1075;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; <br/></p>
<p><b>&#1050;&#1091;&#1079;&#1100;&#1084;&#1080;&#1085; &#1040;&#1088;&#1090;&#1077;&#1084; &#1044;&#1084;&#1080;&#1090;&#1088;&#1080;&#1077;&#1074;&#1080;&#1095; <br/></b> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p><b>&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077; <br/> 1 &#1062;&#1077;&#1083;&#1100; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099;.......................................................................................3 <br/></b></p>
<p><b> 2 &#1042;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099;.........................................................................6 <br/></b></p>
<p><b> 3 &#1042;&#1099;&#1074;&#1086;&#1076;&#1099;...............................................................................................9 <br/></b> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p><b>1 &#1062;&#1077;&#1083;&#1100; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; <br/></b></p>
<p>&#1054;&#1089;&#1074;&#1086;&#1080;&#1090;&#1100; &#1085;&#1072; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1082;&#1077; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1088;&#1077;&#1078;&#1080;&#1084;&#1072; &#1086;&#1076;&#1085;&#1086;&#1082;&#1088;&#1072;&#1090;&#1085;&#1086;&#1075;&#1086; <br/>&#1075;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1085;&#1072; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1077; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1093; <br/>&#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1093; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074; &#1086;&#1076;&#1085;&#1080;&#1084; &#1082;&#1083;&#1102;&#1095;&#1086;&#1084;. <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> <br/></p>
<p><b>2 &#1058;&#1077;&#1086;&#1088;&#1077;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1089;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103; <br/></b></p>
<p><b> <br/> 2.1 &#1064;&#1080;&#1092;&#1088; &#1075;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;  <br/></b>&#1043;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#8211; &#1101;&#1090;&#1086; &#1085;&#1072;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; (&#1089;&#1085;&#1103;&#1090;&#1080;&#1077;) &#1085;&#1072; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1077; (&#1079;&#1072;&#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077;) &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; <br/>&#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081; &#1075;&#1072;&#1084;&#1084;&#1099;, &#1090;.&#1077;. &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1074;&#1099;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1077;&#1084;&#1099;&#1093; &#1089; <br/>&#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1072;, &#1076;&#1083;&#1103; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1079;&#1072;&#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; <br/>(&#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1093;) &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;.  <br/></p>
<p>&#1055;&#1088;&#1080;&#1085;&#1094;&#1080;&#1087; &#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1075;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1079;&#1072;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1075;&#1077;&#1085;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1075;&#1072;&#1084;&#1084;&#1099; &#1096;&#1080;&#1092;&#1088;&#1072; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; <br/>&#1076;&#1072;&#1090;&#1095;&#1080;&#1082;&#1072; &#1087;&#1089;&#1077;&#1074;&#1076;&#1086;&#1089;&#1083;&#1091;&#1095;&#1072;&#1081;&#1085;&#1099;&#1093; &#1095;&#1080;&#1089;&#1077;&#1083; &#1080; &#1085;&#1072;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1080; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1085;&#1086;&#1081; &#1075;&#1072;&#1084;&#1084;&#1099; &#1096;&#1080;&#1092;&#1088;&#1072; &#1085;&#1072; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1077; <br/>&#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1086;&#1073;&#1088;&#1072;&#1090;&#1080;&#1084;&#1099;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1102; &#1089;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086; &#1084;&#1086;&#1076;&#1091;&#1083;&#1102; 2). <br/>&#1055;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089; &#1076;&#1077;&#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1089;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1082; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1085;&#1086;&#1081; &#1075;&#1077;&#1085;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1075;&#1072;&#1084;&#1084;&#1099; &#1096;&#1080;&#1092;&#1088;&#1072; &#1087;&#1088;&#1080; &#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1086;&#1084; <br/>&#1082;&#1083;&#1102;&#1095;&#1077; &#1080; &#1085;&#1072;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1080; &#1090;&#1072;&#1082;&#1086;&#1081; &#1078;&#1077; &#1075;&#1072;&#1084;&#1084;&#1099; &#1085;&#1072; &#1079;&#1072;&#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077;. &#1055;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1085;&#1099;&#1081; <br/>&#1079;&#1072;&#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1090;&#1077;&#1082;&#1089;&#1090; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1090;&#1088;&#1091;&#1076;&#1085;&#1099;&#1084; &#1076;&#1083;&#1103; &#1088;&#1072;&#1089;&#1082;&#1088;&#1099;&#1090;&#1080;&#1103; &#1074; &#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, &#1077;&#1089;&#1083;&#1080; <br/>&#1075;&#1072;&#1084;&#1084;&#1072; &#1096;&#1080;&#1092;&#1088;&#1072; &#1085;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1103;&#1102;&#1097;&#1080;&#1093;&#1089;&#1103; &#1073;&#1080;&#1090;&#1086;&#1074;&#1099;&#1093; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1077;&#1081; &#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; <br/>&#1089;&#1083;&#1091;&#1095;&#1072;&#1081;&#1085;&#1099;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084; &#1076;&#1083;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1096;&#1080;&#1092;&#1088;&#1091;&#1077;&#1084;&#1086;&#1075;&#1086; &#1089;&#1083;&#1086;&#1074;&#1072;. &#1045;&#1089;&#1083;&#1080; &#1087;&#1077;&#1088;&#1080;&#1086;&#1076; &#1075;&#1072;&#1084;&#1084;&#1099; &#1087;&#1088;&#1077;&#1074;&#1099;&#1096;&#1072;&#1077;&#1090; <br/>&#1076;&#1083;&#1080;&#1085;&#1091; &#1074;&#1089;&#1077;&#1075;&#1086; &#1079;&#1072;&#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1080; &#1085;&#1077;&#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1072; &#1085;&#1080;&#1082;&#1072;&#1082;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;, &#1090;&#1086; <br/>&#1096;&#1080;&#1092;&#1088; &#1084;&#1086;&#1078;&#1085;&#1086; &#1088;&#1072;&#1089;&#1082;&#1088;&#1099;&#1090;&#1100; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1088;&#1103;&#1084;&#1099;&#1084; &#1087;&#1077;&#1088;&#1077;&#1073;&#1086;&#1088;&#1086;&#1084; (&#1087;&#1086;&#1076;&#1073;&#1086;&#1088;&#1086;&#1084; &#1082;&#1083;&#1102;&#1095;&#1072;). &#1042; &#1101;&#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; <br/>&#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1089;&#1090;&#1086;&#1081;&#1082;&#1086;&#1089;&#1090;&#1100; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1084; &#1082;&#1083;&#1102;&#1095;&#1072;.  <br/></p>
<p>&#1052;&#1077;&#1090;&#1086;&#1076; &#1075;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1089;&#1103; &#1073;&#1077;&#1089;&#1089;&#1080;&#1083;&#1100;&#1085;&#1099;&#1084;, &#1077;&#1089;&#1083;&#1080; &#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1077;&#1085; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1080; <br/>&#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1072;&#1103; &#1077;&#1084;&#1091; &#1096;&#1080;&#1092;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072;. &#1042; &#1101;&#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1099;&#1084; &#1074;&#1099;&#1095;&#1080;&#1090;&#1072;&#1085;&#1080;&#1077;&#1084; &#1087;&#1086; &#1084;&#1086;&#1076;&#1091;&#1083;&#1102; 2 <br/>&#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1086;&#1090;&#1088;&#1077;&#1079;&#1086;&#1082; &#1087;&#1089;&#1077;&#1074;&#1076;&#1086;&#1089;&#1083;&#1091;&#1095;&#1072;&#1081;&#1085;&#1086;&#1081; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; &#1080; &#1087;&#1086; &#1085;&#1077;&#1084;&#1091; &#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; <br/>&#1074;&#1089;&#1103; &#1101;&#1090;&#1072; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100;. <br/></p>
<p> &#1052;&#1077;&#1090;&#1086;&#1076; &#1075;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1089; &#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1086;&#1081; &#1089;&#1074;&#1103;&#1079;&#1100;&#1102; &#1079;&#1072;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1076;&#1083;&#1103; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072; <br/>&#1075;&#1072;&#1084;&#1084;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1100;&#1085;&#1072;&#1103; &#1089;&#1091;&#1084;&#1084;&#1072; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1091;&#1095;&#1072;&#1089;&#1090;&#1082;&#1072; &#1096;&#1080;&#1092;&#1088;&#1091;&#1077;&#1084;&#1099;&#1093; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. <br/>&#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1077;&#1089;&#1083;&#1080; &#1088;&#1072;&#1089;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1090;&#1100; &#1075;&#1072;&#1084;&#1084;&#1091; &#1096;&#1080;&#1092;&#1088;&#1072; &#1082;&#1072;&#1082; &#1086;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1077; &#1085;&#1077;&#1087;&#1077;&#1088;&#1077;&#1089;&#1077;&#1082;&#1072;&#1102;&#1097;&#1080;&#1093;&#1089;&#1103; <br/>&#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074; H(j), &#1090;&#1086; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089; &#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1077;&#1088;&#1076;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1084;&#1080; &#1096;&#1072;&#1075;&#1072;&#1084;&#1080;:  <br/></p>
<p>1. &#1043;&#1077;&#1085;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072; &#1075;&#1072;&#1084;&#1084;&#1099; H(1) &#1080; &#1085;&#1072;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1077;&#1075;&#1086; &#1085;&#1072; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1081; &#1091;&#1095;&#1072;&#1089;&#1090;&#1086;&#1082; <br/>&#1096;&#1080;&#1092;&#1088;&#1091;&#1077;&#1084;&#1099;&#1093; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;.  <br/></p>
<p>2. &#1055;&#1086;&#1076;&#1089;&#1095;&#1077;&#1090; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1100;&#1085;&#1086;&#1081; &#1089;&#1091;&#1084;&#1084;&#1099; &#1091;&#1095;&#1072;&#1089;&#1090;&#1082;&#1072;, &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1075;&#1086; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1091; &#1075;&#1072;&#1084;&#1084;&#1099; H(1).  <br/></p>
<p>3. &#1043;&#1077;&#1085;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; &#1089; &#1091;&#1095;&#1077;&#1090;&#1086;&#1084; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1100;&#1085;&#1086;&#1081; &#1089;&#1091;&#1084;&#1084;&#1099; &#1091;&#1078;&#1077; &#1079;&#1072;&#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1091;&#1095;&#1072;&#1089;&#1090;&#1082;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; <br/>&#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1075;&#1086; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072; &#1075;&#1072;&#1084;&#1084; H(2).  <br/></p>
<p>4. &#1055;&#1086;&#1076;&#1089;&#1095;&#1077;&#1090; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1100;&#1085;&#1086;&#1081; &#1089;&#1091;&#1084;&#1084;&#1099; &#1091;&#1095;&#1072;&#1089;&#1090;&#1082;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1075;&#1086; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1091; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; H(2) <br/>&#1080; &#1090;.&#1076;.  <br/></p>
<p><b>2.2 &#1048;&#1076;&#1077;&#1103; &#1074;&#1079;&#1083;&#1086;&#1084;&#1072; <br/></b> &#1064;&#1080;&#1092;&#1088;&#1086;&#1090;&#1077;&#1082;&#1089;&#1090;&#1099; &#1086;&#1073;&#1077;&#1080;&#1093; &#1090;&#1077;&#1083;&#1077;&#1075;&#1088;&#1072;&#1084;&#1084; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1087;&#1086; &#1092;&#1086;&#1088;&#1084;&#1091;&#1083;&#1072;&#1084; &#1088;&#1077;&#1078;&#1080;&#1084;&#1072; &#1086;&#1076;&#1085;&#1086;&#1082;&#1088;&#1072;&#1090;&#1085;&#1086;&#1075;&#1086; <br/>&#1075;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;:  <br/></p>
<p>&#55349;&#56374;1 = &#55349;&#56387;1 &#8853; &#55349;&#56382; </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#55349;&#56374;2 = &#55349;&#56387;2 &#8853; &#55349;&#56382; <br/></p>
<p>&#1054;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1081; &#1090;&#1077;&#1082;&#1089;&#1090; &#1084;&#1086;&#1078;&#1085;&#1086; &#1085;&#1072;&#1081;&#1090;&#1080;, &#1079;&#1085;&#1072;&#1103; &#1096;&#1080;&#1092;&#1088;&#1086;&#1090;&#1077;&#1082;&#1089;&#1090; &#1076;&#1074;&#1091;&#1093; &#1090;&#1077;&#1083;&#1077;&#1075;&#1088;&#1072;&#1084;&#1084;, &#1079;&#1072;&#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; &#1086;&#1076;&#1085;&#1080;&#1084; <br/>&#1082;&#1083;&#1102;&#1095;&#1086;&#1084;. &#1044;&#1083;&#1103; &#1101;&#1090;&#1086; &#1086;&#1073;&#1072; &#1088;&#1072;&#1074;&#1077;&#1085;&#1089;&#1090;&#1074;&#1072; &#1089;&#1082;&#1083;&#1072;&#1076;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1087;&#1086; &#1084;&#1086;&#1076;&#1091;&#1083;&#1102; 2. &#1058;&#1086;&#1075;&#1076;&#1072; &#1089; &#1091;&#1095;&#1105;&#1090;&#1086;&#1084; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; <br/>&#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; XOR &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1084;: <br/></p>
<p>&#55349;&#56374;1 &#8853; &#55349;&#56374;2 = &#55349;&#56387;1 &#8853; &#55349;&#56382; &#8853; &#55349;&#56387;2 &#8853; &#55349;&#56382; = &#55349;&#56387;1 &#8853; &#55349;&#56387;2 <br/></p>
<p> &#1055;&#1088;&#1077;&#1076;&#1087;&#1086;&#1083;&#1086;&#1078;&#1080;&#1084;, &#1095;&#1090;&#1086; &#1086;&#1076;&#1085;&#1072; &#1080;&#1079; &#1090;&#1077;&#1083;&#1077;&#1075;&#1088;&#1072;&#1084;&#1084; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1086;&#1084; &#8212; &#1090;.&#1077;. &#1080;&#1084;&#1077;&#1077;&#1090; &#1090;&#1077;&#1082;&#1089;&#1090; <br/>&#1092;&#1080;&#1082;&#1089;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1074;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086;&#1083;&#1077;&#1081;. &#1044;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084;, &#1095;&#1090;&#1086; <br/>&#1079;&#1083;&#1086;&#1091;&#1084;&#1099;&#1096;&#1083;&#1077;&#1085;&#1085;&#1080;&#1082;&#1091; &#1101;&#1090;&#1086;&#1090; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1077;&#1085;. &#1058;&#1086;&#1075;&#1076;&#1072; &#1086;&#1085; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1090; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1084;&#1085;&#1086;&#1075;&#1086; &#1087;&#1072;&#1088; &#55349;&#56374;1 &#8853; &#55349;&#56374;2 <br/>(&#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1077;&#1085; &#1074;&#1080;&#1076; &#1086;&#1073;&#1077;&#1080;&#1093; &#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1086;&#1082;). &#1058;&#1086;&#1075;&#1076;&#1072; &#1079;&#1085;&#1072;&#1103; &#55349;&#56387;1 &#1080;&#1084;&#1077;&#1077;&#1084;:  <br/></p>
<p>&#55349;&#56374;1 &#8853; &#55349;&#56374;2 &#8853; &#55349;&#56387;1 = &#55349;&#56387;1 &#8853; &#55349;&#56387;2 &#8853; &#55349;&#56387;1 = &#55349;&#56387;2 <br/></p>
<p> &#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1079;&#1083;&#1086;&#1091;&#1084;&#1099;&#1096;&#1083;&#1077;&#1085;&#1085;&#1080;&#1082; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1090; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1090;&#1077; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1099; <br/>&#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#55349;&#56387;2 , &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1085;&#1072;&#1093;&#1086;&#1076;&#1103;&#1090;&#1089;&#1103; &#1085;&#1072; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1103;&#1093; &#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1086;&#1075;&#1086; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1072; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#55349;&#56387;1 . &#1042; <br/>&#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1080;&#1080; &#1089; &#1083;&#1086;&#1075;&#1080;&#1082;&#1086;&#1081; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#55349;&#56387;2 , &#1079;&#1083;&#1086;&#1091;&#1084;&#1099;&#1096;&#1083;&#1077;&#1085;&#1085;&#1080;&#1082; &#1080;&#1084;&#1077;&#1077;&#1090; &#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1096;&#1072;&#1085;&#1089; &#1091;&#1079;&#1085;&#1072;&#1090;&#1100; &#1077;&#1097;&#1105; <br/>&#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1086;&#1074; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#55349;&#56387;2 . &#1047;&#1072;&#1090;&#1077;&#1084; &#1074;&#1085;&#1086;&#1074;&#1100; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1088;&#1072;&#1074;&#1077;&#1085;&#1089;&#1090;&#1074;&#1086; &#1089; <br/>&#1087;&#1086;&#1076;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1086;&#1081; &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; &#55349;&#56387;1 &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1085;&#1099;&#1093; &#1085;&#1072; &#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1085;&#1086;&#1074;&#1099;&#1093; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1086;&#1074; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#55349;&#56387;2 <br/>. &#1048; &#1090;&#1072;&#1082; &#1076;&#1072;&#1083;&#1077;&#1077;. &#1044;&#1077;&#1081;&#1089;&#1090;&#1074;&#1091;&#1103; &#1087;&#1086;&#1076;&#1086;&#1073;&#1085;&#1099;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1079;&#1083;&#1086;&#1091;&#1084;&#1099;&#1096;&#1083;&#1077;&#1085;&#1085;&#1080;&#1082; &#1076;&#1072;&#1078;&#1077; &#1077;&#1089;&#1083;&#1080; &#1085;&#1077; &#1087;&#1088;&#1086;&#1095;&#1080;&#1090;&#1072;&#1077;&#1090; &#1086;&#1073;&#1072; <br/>&#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103;, &#1090;&#1086; &#1079;&#1085;&#1072;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1091;&#1084;&#1077;&#1085;&#1100;&#1096;&#1080;&#1090; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1086; &#1080;&#1093; &#1087;&#1086;&#1080;&#1089;&#1082;&#1072;. <br/></p>
<p> <br/></p>
<p> <br/> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p><b>3 &#1042;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; <br/> 3.1 &#1056;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103; &#1074;&#1079;&#1083;&#1086;&#1084;&#1097;&#1080;&#1082;&#1072;, &#1096;&#1080;&#1092;&#1088;&#1072;&#1090;&#1086;&#1088;&#1072; &#1080; &#1076;&#1077;&#1096;&#1080;&#1092;&#1088;&#1072;&#1090;&#1086;&#1088;&#1072; <br/>&#1085;&#1072; Python <br/></b> a = ord(&quot;&#1072;&quot;)  <br/></p>
<p>liters = [chr(i) for i in range(a, a + 32)]  <br/></p>
<p>a = ord(&quot;0&quot;)  <br/></p>
<p>for i in range(a, a+10):  <br/></p>
<p>    liters.append(chr(i)) <br/></p>
<p> <br/></p>
<p>a = ord(&quot;&#1040;&quot;) <br/></p>
<p>for i in range(1040, 1072): <br/></p>
<p>   liters.append(chr(i)) <br/></p>
<p>P1 = &quot;&#1050;&#1086;&#1076;&#1086;&#1092;&#1072;&#1103;&#1060;&#1088;&#1072;&#1079;&#1072;1&quot; <br/></p>
<p>P2 = &quot;&#1041;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1100;2&quot;  <br/></p>
<p>def vzlom(P1, P2): <br/></p>
<p>    code = []  <br/></p>
<p>    for i in range(len(P1)): <br/></p>
<p>        code.append(liters[(liters.index(P1[i]) + liters.index(P2[i])) % len(liters) <br/></p>
<p>        print(code)  <br/></p>
<p>        pr = &quot;&quot;.join(code)  <br/></p>
<p>        print(pr)  <br/></p>
<p>def shifr(P1, gamma):  <br/></p>
<p>    dicts = {&quot;&#1072;&quot;: 1, &quot;&#1073;&quot;: 2, &quot;&#1074;&quot;: 3, &quot;&#1075;&quot;: 4, &quot;&#1076;&quot;: 5, &quot;&#1077;&quot;: 6, &quot;&#1105;&quot;: 7, &quot;&#1078;&quot;: 8, &quot;&#1079;&quot;:&quot;&#1084;&quot;: 14, &quot;&#1085;&quot;: 15, &quot;&#1086;&quot;: 16, &quot;&#1087;&quot;: 17, <br/>&quot;&#1088;&quot;: 18, &quot;&#1089;&quot;: 19, &quot;&#1090;&quot;: 20, &quot;&#1091;&quot;:&quot;&#1096;&quot;: 26, &quot;&#1097;&quot;: 27, &quot;&#1098;&quot;: 28, &quot;&#1099;&quot;: 29, &quot;&#1100;&quot;: 30, &quot;&#1101;&quot;: 31, &quot;&#1102;&quot;: 32, &quot;&#1103;&quot;:&quot;&#1044;&quot;:37 , <br/>&quot;&#1045;&quot;:38 , &quot;&#1025;&quot;:39 , &quot;&#1046;&quot;:40 , &quot;&#1047;&quot;:41, &quot;&#1048;&quot;:42,&quot;&#1049;&quot;:43 , &quot;&#1050;&quot;:44 ,&quot;&#1055;&quot;:49 , &quot;&#1056;&quot;:50 , &quot;&#1057;&quot;:51 , &quot;&#1058;&quot;:52 , &quot;&#1059;&quot;:53 , <br/>&quot;&#1060;&quot;:54 , &quot;&#1061;&quot;:55 , &quot;&#1062;&quot;:5&quot;&#1067;&quot;:61 , &quot;&#1068;&quot;:62 , &quot;&#1069;&quot;:63 , &quot;&#1070;&quot;:64 , &quot;&#1071;&quot;:65 , &quot;1&quot;:66 , &quot;2&quot;:67 , &quot;3&quot;:6&quot;8&quot;:73 , &quot;9&quot;:74 <br/>, &quot;0&quot;:75 }  <br/></p>
<p>    dicts2 = {v: k for k, v in dicts.items()} <br/></p>
<p>    text = P1 <br/></p>
<p>    digits_text = [] <br/></p>
<p>    digits_gamma = []  <br/></p>
<p>   for i in text:  <br/></p>
<p>       digits_text.append(dicts[i])  <br/></p>
<p>        print(&quot;&#1063;&#1080;&#1089;&#1083;&#1072; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &quot;, digits_text)  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>        for i in gamma: <br/></p>
<p>       digits_gamma.append(dicts[i]) <br/></p>
<p>       print(&quot;&#1063;&#1080;&#1089;&#1083;&#1072; &#1075;&#1072;&#1084;&#1084;&#1099; &quot;, digits_gamma)  <br/></p>
<p>       digits_result = []  <br/></p>
<p>        ch = 0  <br/></p>
<p>        for i in text:  <br/></p>
<p>            try:  <br/></p>
<p>                  a = dicts[i] + digits_gamma[ch] <br/></p>
<p>                  except: <br/></p>
<p>                               ch = 0  <br/></p>
<p>                               a = dicts[i] + digits_gamma[ch]  <br/></p>
<p>                               if a &gt; 75: <br/></p>
<p>                                  a = a%75 <br/></p>
<p>                                  print(a) <br/></p>
<p>                                  ch += 1  <br/></p>
<p>                                  digits_result.append(a)  <br/></p>
<p>                            print(&quot;&#1063;&#1080;&#1089;&#1083;&#1072; &#1096;&#1080;&#1092;&#1088;&#1086;&#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &quot;, digits_result)  <br/></p>
<p>text_cr = &quot;&quot;  <br/></p>
<p>for i in digits_result:  <br/></p>
<p>text_cr += dicts2[i]  <br/></p>
<p>print(&quot;&#1064;&#1080;&#1092;&#1088;&#1086;&#1090;&#1077;&#1082;&#1089;&#1090; &quot;, text_cr)  <br/></p>
<p>digits = []  <br/></p>
<p>for i in text_cr:  <br/></p>
<p>digits.append(dicts[i]) <br/></p>
<p>ch = 0  <br/></p>
<p>digits1 = []  <br/></p>
<p>for i in digits: try:  <br/></p>
<p>a = i - digits_gamma[ch]  <br/></p>
<p>except: <br/></p>
<p> ch = 0 <br/></p>
<p> a = i - digits_gamma[ch]  <br/></p>
<p>if a &lt; 1: <br/></p>
<p> a = 75 + a <br/></p>
<p>digits1.append(a)  </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>ch += 1 <br/></p>
<p>text_decr = &quot;&quot; <br/></p>
<p> for i in digits1: <br/></p>
<p> text_decr += dicts2[i]  <br/></p>
<p>print(&quot;&#1056;&#1072;&#1089;&#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1090;&#1077;&#1082;&#1089;&#1090;: &quot;, text_decr) <br/></p>
<p> <br/></p>
<p><b>3.2 &#1050;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1100;&#1085;&#1099;&#1081; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; <br/></b> <br/></p>
<p> <br/>&#1056;&#1080;&#1089;. 1: &#1056;&#1072;&#1073;&#1086;&#1090;&#1072; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1072; &#1074;&#1079;&#1083;&#1086;&#1084;&#1072; &#1082;&#1083;&#1102;&#1095;&#1072; <br/></p>
<p> <br/>Figure 2: &#1056;&#1072;&#1073;&#1086;&#1090;&#1072; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1072; &#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1080; &#1076;&#1077;&#1096;&#1080;&#1074;&#1088;&#1086;&#1074;&#1082;&#1080; <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p><b>4 &#1042;&#1099;&#1074;&#1086;&#1076; <br/></b>&#1042; &#1093;&#1086;&#1076;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1083;&#1072;&#1073;&#1086;&#1088;&#1072;&#1090;&#1086;&#1088;&#1085;&#1086;&#1081; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1073;&#1099;&#1083;&#1086; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1085;&#1086; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;, <br/>&#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1097;&#1077;&#1077; &#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1090;&#1077;&#1082;&#1089;&#1090;&#1099; &#1074; &#1088;&#1077;&#1078;&#1080;&#1084;&#1077; &#1086;&#1076;&#1085;&#1086;&#1082;&#1088;&#1072;&#1090;&#1085;&#1086;&#1075;&#1086; &#1075;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; <br/> </p>

</div></div>
</body></html>