<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title></title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p><b> <br/> <br/> <br/> <br/></b></p>
<p><b>&#1048;&#1085;&#1076;&#1080;&#1074;&#1080;&#1076;&#1091;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; <br/>&#1069;&#1090;&#1072;&#1087; 2. &#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072; DVWA <br/></b></p>
<p><b>&#1050;&#1091;&#1079;&#1100;&#1084;&#1080;&#1085; &#1040;&#1088;&#1090;&#1077;&#1084; &#1044;&#1084;&#1080;&#1090;&#1088;&#1080;&#1077;&#1074;&#1080;&#1095; <br/> <br/> <br/> <br/> <br/> <br/> <br/> <br/> <br/> <br/> <br/> <br/> </b></p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p><b>&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077; <br/> 1 &#1062;&#1077;&#1083;&#1100; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099;.......................................................................................3 <br/></b></p>
<p><b> 2 &#1042;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099;.........................................................................4 <br/></b></p>
<p><b> 3 &#1042;&#1099;&#1074;&#1086;&#1076;&#1099;...............................................................................................6 <br/></b></p>
<p><b> <br/></b></p>
<p><b> <br/></b></p>
<p><b> <br/></b></p>
<p><b> <br/></b></p>
<p><b> <br/></b></p>
<p><b> <br/></b></p>
<p><b> <br/></b></p>
<p><b> <br/></b></p>
<p><b> <br/></b></p>
<p><b> <br/></b></p>
<p><b> <br/></b></p>
<p><b> <br/></b></p>
<p><b> <br/></b></p>
<p><b> <br/></b></p>
<p><b> <br/></b></p>
<p><b> <br/></b></p>
<p><b> <br/></b></p>
<p><b> <br/></b></p>
<p><b> <br/></b></p>
<p><b> <br/></b></p>
<p><b> <br/></b></p>
<p><b> </b></p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p><b>1 &#1062;&#1077;&#1083;&#1100; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099;  <br/></b>   &#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1077; DVWA &#1074; &#1075;&#1086;&#1089;&#1090;&#1077;&#1074;&#1091;&#1102; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1091; &#1082; Kali Linux. &#1056;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1081;: <br/>https://github.com/digininja/DVWA. &#1053;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1080;&#1079; &#1091;&#1103;&#1079;&#1074;&#1080;&#1084;&#1086;&#1089;&#1090;&#1077;&#1081; &#1074;&#1077;&#1073; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; <br/>&#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; DVWA: &#1041;&#1088;&#1091;&#1090;&#1092;&#1086;&#1088;&#1089;: &#1041;&#1088;&#1091;&#1090;&#1092;&#1086;&#1088;&#1089; HTTP &#1092;&#1086;&#1088;&#1084;&#1099; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; &#1074;&#1093;&#1086;&#1076;&#1072; - &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; <br/>&#1090;&#1077;&#1089;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1087;&#1086; &#1072;&#1090;&#1072;&#1082;&#1077; &#1085;&#1072; &#1087;&#1072;&#1088;&#1086;&#1083;&#1100; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1084; &#1075;&#1088;&#1091;&#1073;&#1086;&#1081; &#1089;&#1080;&#1083;&#1099; &#1080; &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; <br/>&#1085;&#1077;&#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1100; &#1089;&#1083;&#1072;&#1073;&#1099;&#1093; &#1087;&#1072;&#1088;&#1086;&#1083;&#1077;&#1081;. &#1048;&#1089;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077; (&#1074;&#1085;&#1077;&#1076;&#1088;&#1077;&#1085;&#1080;&#1077;) &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;: &#1042;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076; <br/>&#1091;&#1088;&#1086;&#1074;&#1085;&#1103; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;. &#1052;&#1077;&#1078;&#1089;&#1072;&#1081;&#1090;&#1086;&#1074;&#1072;&#1103; &#1087;&#1086;&#1076;&#1076;&#1077;&#1083;&#1082;&#1072; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1072; (CSRF): &#1055;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; <br/>&#171;&#1072;&#1090;&#1072;&#1082;&#1091;&#1102;&#1097;&#1077;&#1084;&#1091;&#187; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1087;&#1072;&#1088;&#1086;&#1083;&#1100; &#1072;&#1076;&#1084;&#1080;&#1085;&#1080;&#1089;&#1090;&#1088;&#1072;&#1090;&#1086;&#1088;&#1072; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081;. &#1042;&#1085;&#1077;&#1076;&#1088;&#1077;&#1085;&#1080;&#1077; (&#1080;&#1085;&#1082;&#1083;&#1091;&#1076;) <br/>&#1092;&#1072;&#1081;&#1083;&#1086;&#1074;: &#1055;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#171;&#1072;&#1090;&#1072;&#1082;&#1091;&#1102;&#1097;&#1077;&#1084;&#1091;&#187; &#1087;&#1088;&#1080;&#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1080;&#1090;&#1100; &#1091;&#1076;&#1072;&#1083;&#1105;&#1085;&#1085;&#1099;&#1077;/&#1083;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099; &#1074; &#1074;&#1077;&#1073; <br/>&#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;. SQL &#1074;&#1085;&#1077;&#1076;&#1088;&#1077;&#1085;&#1080;&#1077;: &#1055;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#171;&#1072;&#1090;&#1072;&#1082;&#1091;&#1102;&#1097;&#1077;&#1084;&#1091;&#187; &#1074;&#1085;&#1077;&#1076;&#1088;&#1080;&#1090;&#1100; SQL &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1074; HTTP <br/>&#1080;&#1079; &#1087;&#1086;&#1083;&#1103; &#1074;&#1074;&#1086;&#1076;&#1072;, DVWA &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090; &#1089;&#1083;&#1077;&#1087;&#1086;&#1077; &#1080; &#1086;&#1089;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1077; &#1085;&#1072; &#1086;&#1096;&#1080;&#1073;&#1082;&#1077; SQL &#1074;&#1085;&#1077;&#1076;&#1088;&#1077;&#1085;&#1080;&#1077;. <br/>&#1053;&#1077;&#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1072;&#1103; &#1074;&#1099;&#1075;&#1088;&#1091;&#1079;&#1082;&#1072; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;: &#1055;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#171;&#1072;&#1090;&#1072;&#1082;&#1091;&#1102;&#1097;&#1077;&#1084;&#1091;&#187; &#1074;&#1099;&#1075;&#1088;&#1091;&#1079;&#1080;&#1090;&#1100; &#1074;&#1088;&#1077;&#1076;&#1086;&#1085;&#1086;&#1089;&#1085;&#1099;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099; <br/>&#1085;&#1072; &#1074;&#1077;&#1073; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;. &#1052;&#1077;&#1078;&#1089;&#1072;&#1081;&#1090;&#1086;&#1074;&#1099;&#1081; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1080;&#1085;&#1075; (XSS): &#171;&#1040;&#1090;&#1072;&#1082;&#1091;&#1102;&#1097;&#1080;&#1081;&#187; &#1084;&#1086;&#1078;&#1077;&#1090; &#1074;&#1085;&#1077;&#1076;&#1088;&#1080;&#1090;&#1100; &#1089;&#1074;&#1086;&#1080; <br/>&#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1099; &#1074; &#1074;&#1077;&#1073; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;/&#1073;&#1072;&#1079;&#1091; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. DVWA &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090; &#1086;&#1090;&#1088;&#1072;&#1078;&#1105;&#1085;&#1085;&#1091;&#1102; &#1080; &#1093;&#1088;&#1072;&#1085;&#1080;&#1084;&#1091;&#1102; XSS. <br/>&#1055;&#1072;&#1089;&#1093;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1103;&#1081;&#1094;&#1072;: &#1088;&#1072;&#1089;&#1082;&#1088;&#1099;&#1090;&#1080;&#1077; &#1087;&#1086;&#1083;&#1085;&#1099;&#1093; &#1087;&#1091;&#1090;&#1077;&#1081;, &#1086;&#1073;&#1093;&#1086;&#1076; &#1072;&#1091;&#1090;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1094;&#1080;&#1080; &#1080; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077;. <br/>DVWA &#1080;&#1084;&#1077;&#1077;&#1090; &#1090;&#1088;&#1080; &#1091;&#1088;&#1086;&#1074;&#1085;&#1103; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1086;&#1085;&#1080; &#1084;&#1077;&#1085;&#1103;&#1102;&#1090; &#1091;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1074;&#1077;&#1073; <br/>&#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1074; DVWA: &#1053;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099;&#1081; &#8212; &#1101;&#1090;&#1086;&#1090; &#1091;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1073;&#1099;&#1090;&#1100; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1099;&#1084; &#1086;&#1090; &#1074;&#1089;&#1077;&#1093; <br/>&#1091;&#1103;&#1079;&#1074;&#1080;&#1084;&#1086;&#1089;&#1090;&#1077;&#1081;. &#1054;&#1085; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1089;&#1088;&#1072;&#1074;&#1085;&#1077;&#1085;&#1080;&#1103; &#1091;&#1103;&#1079;&#1074;&#1080;&#1084;&#1086;&#1075;&#1086; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1076;&#1072; &#1089; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1099;&#1084; <br/>&#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1084; &#1082;&#1086;&#1076;&#1086;&#1084;. &#1042;&#1099;&#1089;&#1086;&#1082;&#1080;&#1081; &#8212; &#1101;&#1090;&#1086; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1077; &#1089;&#1088;&#1077;&#1076;&#1085;&#1077;&#1075;&#1086; &#1091;&#1088;&#1086;&#1074;&#1085;&#1103; &#1089;&#1083;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1089;&#1086; &#1089;&#1084;&#1077;&#1089;&#1100;&#1102; <br/>&#1073;&#1086;&#1083;&#1077;&#1077; &#1089;&#1083;&#1086;&#1078;&#1085;&#1099;&#1093; &#1080;&#1083;&#1080; &#1072;&#1083;&#1100;&#1090;&#1077;&#1088;&#1085;&#1072;&#1090;&#1080;&#1074;&#1085;&#1099;&#1093; &#1087;&#1083;&#1086;&#1093;&#1080;&#1093; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1082; &#1074; &#1087;&#1086;&#1087;&#1099;&#1090;&#1082;&#1077; &#1086;&#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1080;&#1090;&#1100; &#1082;&#1086;&#1076;. <br/>&#1059;&#1103;&#1079;&#1074;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1085;&#1077; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1090; &#1090;&#1072;&#1082;&#1086;&#1081; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1088; &#1101;&#1082;&#1089;&#1087;&#1083;&#1091;&#1072;&#1090;&#1072;&#1094;&#1080;&#1080; &#1082;&#1072;&#1082; &#1085;&#1072; 3 &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1091;&#1088;&#1086;&#1074;&#1085;&#1103;&#1093;. &#1057;&#1088;&#1077;&#1076;&#1085;&#1080;&#1081; <br/>&#8212; &#1101;&#1090;&#1086;&#1090; &#1091;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080; &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085; &#1075;&#1083;&#1072;&#1074;&#1085;&#1099;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084; &#1076;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1076;&#1072;&#1090;&#1100; <br/>&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1102; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1087;&#1083;&#1086;&#1093;&#1080;&#1093; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1082; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1075;&#1076;&#1077; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082; &#1087;&#1086;&#1087;&#1099;&#1090;&#1072;&#1083;&#1089;&#1103; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; <br/>&#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1099;&#1084;, &#1085;&#1086; &#1087;&#1086;&#1090;&#1077;&#1088;&#1087;&#1077;&#1083; &#1085;&#1077;&#1091;&#1076;&#1072;&#1095;&#1091;. &#1053;&#1080;&#1079;&#1082;&#1080;&#1081; &#8212; &#1101;&#1090;&#1086;&#1090; &#1091;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080; <br/>&#1089;&#1086;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1085;&#1086; &#1091;&#1103;&#1079;&#1074;&#1080;&#1084; &#1080; &#1089;&#1086;&#1074;&#1089;&#1077;&#1084; &#1085;&#1077; &#1080;&#1084;&#1077;&#1077;&#1090; &#1079;&#1072;&#1097;&#1080;&#1090;&#1099;. &#1045;&#1075;&#1086; &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1073;&#1099;&#1090;&#1100; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1086;&#1084; &#1089;&#1088;&#1077;&#1076;&#1080; <br/>&#1091;&#1103;&#1079;&#1074;&#1080;&#1084;&#1099;&#1093; &#1074;&#1077;&#1073; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081;, &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1086;&#1084; &#1087;&#1083;&#1086;&#1093;&#1080;&#1093; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1082; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1080; &#1089;&#1083;&#1091;&#1078;&#1080;&#1090;&#1100; <br/>&#1087;&#1083;&#1072;&#1090;&#1092;&#1086;&#1088;&#1084;&#1086;&#1081; &#1086;&#1073;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1073;&#1072;&#1079;&#1086;&#1074;&#1099;&#1084; &#1090;&#1077;&#1093;&#1085;&#1080;&#1082;&#1072;&#1084; &#1101;&#1082;&#1089;&#1087;&#1083;&#1091;&#1072;&#1090;&#1072;&#1094;&#1080;&#1080;. <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p><b>2 &#1042;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099;</b>  <br/>    &#1044;&#1083;&#1103; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1085;&#1072; &#1050;&#1072;&#1083;&#1080; &#1051;&#1080;&#1085;&#1091;&#1082;&#1089; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; &#1084;&#1086;&#1078;&#1085;&#1086; <br/>&#1074;&#1086;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1086;&#1081; &#1074; &#1086;&#1076;&#1085;&#1091; &#1089;&#1090;&#1088;&#1086;&#1082;&#1091;. sudo bash -c &quot;$(curl --fail --show-error --silent --<br/>location https://raw.githubusercontent.com/IamCarron/DVWA-Script/main/Install-DVWA.sh)&quot; .&#1048;&#1083;&#1080; &#1078;&#1077; <br/>&#1089;&#1082;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080;&#1079; &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1103; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1086;&#1095;&#1085;&#1099;&#1081; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090; &#1080; &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100; &#1077;&#1075;&#1086;.  <br/></p>
<p> <br/>&#1056;&#1080;&#1089; 1. &#1055;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080; <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> <br/></p>
<p> <br/></p>
<p> <br/>&#1056;&#1080;&#1089; 2. &#1054;&#1082;&#1086;&#1085;&#1095;&#1072;&#1085;&#1080;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080; <br/></p>
<p> <br/></p>
<p>&#1056;&#1080;&#1089; 3. &#1057;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072; DVWA <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> <br/></p>
<p> </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p> <br/></p>
<p><b>4 &#1042;&#1099;&#1074;&#1086;&#1076; <br/></b>&#1071; &#1087;&#1088;&#1080;&#1086;&#1073;&#1088;&#1077;&#1083; &#1079;&#1085;&#1072;&#1085;&#1080;&#1103; &#1087;&#1086; DVWA &#1080; &#1089;&#1072;&#1084;&#1086;&#1089;&#1090;&#1086;&#1103;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1083; &#1077;&#1075;&#1086; &#1095;&#1077;&#1088;&#1077;&#1079; <br/>&#1090;&#1077;&#1088;&#1084;&#1080;&#1085;&#1072;&#1083; </p>

</div></div>
</body></html>