<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title></title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p>&#1044;&#1048;&#1057;&#1050;&#1056;&#1045;&#1062;&#1048;&#1054;&#1053;&#1053;&#1054;&#1045;<br/>&#1056;&#1040;&#1047;&#1043;&#1056;&#1040;&#1053;&#1048;&#1063;&#1045;&#1053;&#1048;&#1045; &#1055;&#1056;&#1040;&#1042; &#1042;<br/>LINUX. &#1056;&#1040;&#1057;&#1064;&#1048;&#1056;&#1045;&#1053;&#1053;&#1067;&#1045;<br/>&#1040;&#1058;&#1056;&#1048;&#1041;&#1059;&#1058;&#1067;<br/>&#1050;&#1059;&#1047;&#1068;&#1052;&#1048;&#1053; &#1040;&#1056;&#1058;&#1045;&#1052;<br/></p>
<p>04 &#1040;&#1055;&#1056;&#1045;&#1051;&#1071;, 2025, &#1052;&#1054;&#1057;&#1050;&#1042;&#1040;, &#1056;&#1054;&#1057;&#1057;&#1048;&#1071;<br/></p>
<p>&#1056;&#1054;&#1057;&#1057;&#1048;&#1049;&#1057;&#1050;&#1048;&#1049; &#1059;&#1053;&#1048;&#1042;&#1045;&#1056;&#1057;&#1048;&#1058;&#1045;&#1058; &#1044;&#1056;&#1059;&#1046;&#1041;&#1067; &#1053;&#1040;&#1056;&#1054;&#1044;&#1054;&#1042;</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#1062;&#1045;&#1051;&#1068; &#1051;&#1040;&#1041;&#1054;&#1056;&#1040;&#1058;&#1054;&#1056;&#1053;&#1054;&#1049; &#1056;&#1040;&#1041;&#1054;&#1058;&#1067;<br/></p>
<p>&#1055;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1085;&#1072;&#1074;&#1099;&#1082;&#1086;&#1074; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1074; &#1082;&#1086;&#1085;&#1089;&#1086;&#1083;&#1080; &#1089; <br/>&#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1085;&#1099;&#1084;&#1080; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1072;&#1084;&#1080; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#1055;&#1056;&#1054;&#1062;&#1045;&#1057;&#1057; &#1042;&#1067;&#1055;&#1054;&#1051;&#1053;&#1045;&#1053;&#1048;&#1071; &#1051;&#1040;&#1041;&#1054;&#1056;&#1040;&#1058;&#1054;&#1056;&#1053;&#1054;&#1049; &#1056;&#1040;&#1041;&#1054;&#1058;&#1067;</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#1054;&#1055;&#1056;&#1045;&#1044;&#1045;&#1051;&#1071;&#1045;&#1052; &#1056;&#1040;&#1057;&#1064;&#1048;&#1056;&#1045;&#1053;&#1053;&#1067;&#1045; &#1040;&#1058;&#1056;&#1048;&#1041;&#1059;&#1058;&#1067; &#1060;&#1040;&#1049;&#1051;&#1040;<br/></p>
<p>&#1056;&#1080;&#1089; 1. &#1042;&#1074;&#1086;&#1076;&#1080;&#1084; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1074; &#1090;&#1077;&#1088;&#1084;&#1080;&#1085;&#1072;&#1083;</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#1056;&#1040;&#1041;&#1054;&#1058;&#1040; &#1057; &#1056;&#1040;&#1057;&#1064;&#1048;&#1056;&#1045;&#1053;&#1053;&#1067;&#1052; &#1058;&#1045;&#1056;&#1052;&#1048;&#1053;&#1040;&#1051;&#1054;&#1052;<br/></p>
<p>&#1056;&#1080;&#1089; 2. &#1056;&#1072;&#1073;&#1086;&#1090;&#1072; &#1089; &#1089;&#1091;&#1087;&#1077;&#1088;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1084;&#1080; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072;&#1084;&#1080;</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#1044;&#1054;&#1041;&#1040;&#1042;&#1040;&#1048;&#1051;&#1048; &#1057;&#1058;&#1056;&#1054;&#1050;&#1059; &#1042; &#1060;&#1040;&#1049;&#1051;<br/></p>
<p>&#1056;&#1080;&#1089; 3. &#1054;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; File1</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#1042;&#1067;&#1042;&#1054;&#1044;<br/></p>
<p>&#1042; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1103; &#1087;&#1086;&#1074;&#1099;&#1089;&#1080;&#1083; &#1089;&#1074;&#1086;&#1080; &#1085;&#1072;&#1074;&#1099;&#1082;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1072;<br/>&#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1086;&#1081; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; (CLI), &#1087;&#1086;&#1079;&#1085;&#1072;&#1082;&#1086;&#1084;&#1080;&#1083;&#1089;&#1103; &#1085;&#1072; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1072;&#1093; &#1089; &#1090;&#1077;&#1084;, &#1082;&#1072;&#1082; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077;<br/>&#1080; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1085;&#1099;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; &#1087;&#1088;&#1080; &#1088;&#1072;&#1079;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1080; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072;. &#1048;&#1084;&#1077;&#1083; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1089;&#1074;&#1103;&#1079;&#1072;&#1090;&#1100;<br/>&#1090;&#1077;&#1086;&#1088;&#1080;&#1102; &#1076;&#1080;&#1089;&#1082;&#1088;&#1077;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1075;&#1086; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; (&#1076;&#1080;&#1089;&#1082;&#1088;&#1077;&#1094;&#1080;&#1086;&#1085;&#1085;&#1072;&#1103; &#1087;&#1086;&#1083;&#1080;&#1090;&#1080;&#1082;&#1072;<br/>&#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1080;) &#1089; &#1077;&#1105; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1077;&#1081; &#1085;&#1072; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1082;&#1077; &#1074; &#1054;&#1057; Linux. &#1057;&#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1083; &#1085;&#1072;&#1075;&#1083;&#1103;&#1076;&#1085;&#1099;&#1077;<br/>&#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099;, &#1087;&#1086;&#1103;&#1089;&#1085;&#1103;&#1102;&#1097;&#1080;&#1077; &#1082;&#1072;&#1082;&#1080;&#1077; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099; &#1087;&#1088;&#1080; &#1090;&#1077;&#1093; &#1080;&#1083;&#1080; &#1080;&#1085;&#1099;&#1093; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093;<br/>&#1087;&#1088;&#1072;&#1074;&#1072;&#1093;. &#1054;&#1087;&#1088;&#1086;&#1073;&#1086;&#1074;&#1072;&#1083; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1077; &#1085;&#1072; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1082;&#1077; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1085;&#1099;&#1093; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1074; &#171;&#1072;&#187; &#1080; &#171;i&#187;</p>

</div></div>
</body></html>