<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html><head><title>&#1044;&#1080;&#1089;&#1082;&#1088;&#1077;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1077; &#1088;&#1072;&#1079;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1072;&#1074; &#1074; Linux. &#1048;&#1089;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1074;&#1083;&#1080;&#1103;&#1085;&#1080;&#1103; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1074;</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
</head>
<body>
<div style="page-break-before:always; page-break-after:always"><div><p><b>&#1064;&#1080;&#1092;&#1088; <br/>&#1075;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; <br/></b>&#1050;&#1091;&#1079;&#1100;&#1084;&#1080;&#1085; &#1040;&#1088;&#1090;&#1077;&#1084;<br/></p>
<p>29 &#1084;&#1072;&#1103;, 2025, &#1052;&#1086;&#1089;&#1082;&#1074;&#1072;, &#1056;&#1086;&#1089;&#1089;&#1080;&#1103;<br/></p>
<p>&#1056;&#1086;&#1089;&#1089;&#1080;&#1081;&#1089;&#1082;&#1080;&#1081; &#1059;&#1085;&#1080;&#1074;&#1077;&#1088;&#1089;&#1080;&#1090;&#1077;&#1090; &#1044;&#1088;&#1091;&#1078;&#1073;&#1099; &#1053;&#1072;&#1088;&#1086;&#1076;&#1086;&#1074;<br/></p>
<p>1/8</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p><b>&#1062;&#1077;&#1083;&#1080; &#1080; &#1079;&#1072;&#1076;&#1072;&#1095;&#1080;</b></p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p><b>&#1062;&#1077;&#1083;&#1100; &#1083;&#1072;&#1073;&#1086;&#1088;&#1072;&#1090;&#1086;&#1088;&#1085;&#1086;&#1081; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099;<br/></b></p>
<p>&#8226;&#1054;&#1089;&#1074;&#1086;&#1080;&#1090;&#1100; &#1085;&#1072; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1082;&#1077; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; <br/>&#1088;&#1077;&#1078;&#1080;&#1084;&#1072; &#1086;&#1076;&#1085;&#1086;&#1082;&#1088;&#1072;&#1090;&#1085;&#1086;&#1075;&#1086; &#1075;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; <br/>&#1085;&#1072; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1077; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1093; <br/>&#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1093; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074; &#1086;&#1076;&#1085;&#1080;&#1084; &#1082;&#1083;&#1102;&#1095;&#1086;&#1084;.</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p><b>&#1042;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077; &#1083;&#1072;&#1073;&#1086;&#1088;&#1072;&#1090;&#1086;&#1088;&#1085;&#1086;&#1081;<br/>&#1088;&#1072;&#1073;&#1086;&#1090;&#1099;</b></p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#1043;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;<br/></p>
<p>&#1043;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#8211; &#1101;&#1090;&#1086; &#1085;&#1072;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; (&#1089;&#1085;&#1103;&#1090;&#1080;&#1077;) &#1085;&#1072; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1077; <br/>(&#1079;&#1072;&#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077;) &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081; &#1075;&#1072;&#1084;&#1084;&#1099;, &#1090;.&#1077;. <br/>&#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1074;&#1099;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1077;&#1084;&#1099;&#1093; <br/>&#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1082;&#1088;&#1080;&#1087;&#1090;&#1086;&#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1072;, <br/>&#1076;&#1083;&#1103; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1079;&#1072;&#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; (&#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1093;) &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#1040;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084; &#1074;&#1079;&#1083;&#1086;&#1084;&#1072; <br/></p>
<p>&#1064;&#1080;&#1092;&#1088;&#1086;&#1090;&#1077;&#1082;&#1089;&#1090;&#1099; &#1086;&#1073;&#1077;&#1080;&#1093; &#1090;&#1077;&#1083;&#1077;&#1075;&#1088;&#1072;&#1084;&#1084; &#1084;&#1086;&#1078;&#1085;&#1086; <br/>&#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1087;&#1086; &#1092;&#1086;&#1088;&#1084;&#1091;&#1083;&#1072;&#1084; &#1088;&#1077;&#1078;&#1080;&#1084;&#1072; <br/>&#1086;&#1076;&#1085;&#1086;&#1082;&#1088;&#1072;&#1090;&#1085;&#1086;&#1075;&#1086; &#1075;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;:<br/></p>
<p>&#55349;&#56374;1 = &#55349;&#56387;1 &#8853; &#55349;&#56382; &#55349;&#56374;2 = <br/>&#55349;&#56387;2 &#8853; &#55349;&#56382;</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#1040;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084; &#1074;&#1079;&#1083;&#1086;&#1084;&#1072; <br/></p>
<p>&#1054;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1081; &#1090;&#1077;&#1082;&#1089;&#1090; &#1084;&#1086;&#1078;&#1085;&#1086; &#1085;&#1072;&#1081;&#1090;&#1080;, &#1079;&#1085;&#1072;&#1103; <br/>&#1096;&#1080;&#1092;&#1088;&#1086;&#1090;&#1077;&#1082;&#1089;&#1090; &#1076;&#1074;&#1091;&#1093; &#1090;&#1077;&#1083;&#1077;&#1075;&#1088;&#1072;&#1084;&#1084;, <br/>&#1079;&#1072;&#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; &#1086;&#1076;&#1085;&#1080;&#1084; &#1082;&#1083;&#1102;&#1095;&#1086;&#1084;. &#1044;&#1083;&#1103; <br/>&#1101;&#1090;&#1086; &#1086;&#1073;&#1072; &#1088;&#1072;&#1074;&#1077;&#1085;&#1089;&#1090;&#1074;&#1072; &#1089;&#1082;&#1083;&#1072;&#1076;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1087;&#1086; <br/>&#1084;&#1086;&#1076;&#1091;&#1083;&#1102; 2. &#1058;&#1086;&#1075;&#1076;&#1072; &#1089; &#1091;&#1095;&#1105;&#1090;&#1086;&#1084; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; <br/>&#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; XOR &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1084;:<br/></p>
<p>&#55349;&#56374;1 &#8853; &#55349;&#56374;2 = &#55349;&#56387;1 &#8853; &#55349;&#56382; &#8853; &#55349;&#56387;2 &#8853; &#55349;&#56382; = &#55349;&#56387;1 &#8853; &#55349;&#56387;2 </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#1040;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084; &#1074;&#1079;&#1083;&#1086;&#1084;&#1072; <br/></p>
<p>&#1055;&#1088;&#1077;&#1076;&#1087;&#1086;&#1083;&#1086;&#1078;&#1080;&#1084;, &#1095;&#1090;&#1086; &#1086;&#1076;&#1085;&#1072; &#1080;&#1079; &#1090;&#1077;&#1083;&#1077;&#1075;&#1088;&#1072;&#1084;&#1084; <br/>&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1086;&#1084; &#8212; &#1090;.&#1077;. &#1080;&#1084;&#1077;&#1077;&#1090; &#1090;&#1077;&#1082;&#1089;&#1090; <br/>&#1092;&#1080;&#1082;&#1089;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; <br/>&#1074;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086;&#1083;&#1077;&#1081;. <br/>&#1044;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084;, &#1095;&#1090;&#1086; &#1079;&#1083;&#1086;&#1091;&#1084;&#1099;&#1096;&#1083;&#1077;&#1085;&#1085;&#1080;&#1082;&#1091; &#1101;&#1090;&#1086;&#1090; <br/>&#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1077;&#1085;. &#1058;&#1086;&#1075;&#1076;&#1072; &#1086;&#1085; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1090; <br/>&#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1084;&#1085;&#1086;&#1075;&#1086; &#1087;&#1072;&#1088; &#55349;&#56374;1 &#8853; &#55349;&#56374;2 <br/>(&#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1077;&#1085; &#1074;&#1080;&#1076; &#1086;&#1073;&#1077;&#1080;&#1093; &#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1086;&#1082;). &#1058;&#1086;&#1075;&#1076;&#1072; <br/>&#1079;&#1085;&#1072;&#1103; &#55349;&#56387;1 &#1080;&#1084;&#1077;&#1077;&#1084;:<br/></p>
<p>&#55349;&#56374;1 &#8853; &#55349;&#56374;2 &#8853; &#55349;&#56387;1 = &#55349;&#56387;1 &#8853; &#55349;&#56387;2 &#8853; &#55349;&#56387;1 = &#55349;&#56387;2</p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#1057;&#1093;&#1077;&#1084;&#1072; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1072; <br/></p>
<p>&#1056;&#1080;&#1089;. 1: &#1056;&#1072;&#1073;&#1086;&#1090;&#1072; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1072; <br/>&#1075;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; <br/></p>
<p>&#1056;&#1080;&#1089;. 2: &#1056;&#1072;&#1073;&#1086;&#1090;&#1072; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1072; &#1074;&#1079;&#1083;&#1086;&#1084;&#1072; <br/>&#1082;&#1083;&#1102;&#1095;&#1072; </p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p><b>&#1042;&#1099;&#1074;&#1086;&#1076;&#1099;</b></p>

</div></div>
<div style="page-break-before:always; page-break-after:always"><div><p><b>&#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1099; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1083;&#1072;&#1073;&#1086;&#1088;&#1072;&#1090;&#1086;&#1088;&#1085;&#1086;&#1081; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099;<br/></b></p>
<p>&#1042; &#1093;&#1086;&#1076;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1083;&#1072;&#1073;&#1086;&#1088;&#1072;&#1090;&#1086;&#1088;&#1085;&#1086;&#1081; <br/>&#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1073;&#1099;&#1083;&#1086; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1085;&#1086; <br/>&#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;, &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1097;&#1077;&#1077; <br/>&#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1090;&#1077;&#1082;&#1089;&#1090;&#1099; &#1074; &#1088;&#1077;&#1078;&#1080;&#1084;&#1077; <br/>&#1086;&#1076;&#1085;&#1086;&#1082;&#1088;&#1072;&#1090;&#1085;&#1086;&#1075;&#1086; &#1075;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;.</p>

</div></div>
</body></html>